Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: :option:`author` and :option:`author_email`, or --- & :option:`maintainer` and :option:`maintainer_email`
pl: :option:`author` i :option:`author_email`, lub --- & :option:`maintainer` i :option:`maintainer_email`

source: Copyright
pl: Licencja

source: Url
pl: adres Url

source: %description (section)
pl: %opis (sekcja)

source: Additionally, there are many options in :file:`.spec` files that don't have corresponding options in the setup script. Most of these are handled through options to the :command:`bdist_rpm` command as follows:
pl: Dodatkowo, istnieje wiele opcji w plikach :file:`.spec` które nie muszą mieć odpowiadających opcji w skrypcie instalacyjnym. Większość z tych jest obsługiwana przez opcje polecenia :command:`bdist_rpm` jak następuje:

source: default value
pl: wartość domyślna

source: Release
pl: Wydanie

source: Group
pl: Grupa

source: "Development/Libraries"
pl: "Rozwój/Biblioteki"

source: (see above)
pl: (zobacz powyżej)

source: Packager
pl: Pakujący

source: (none)
pl: (żaden)

source: Provides
pl: Dostarcza

source: Requires
pl: Wymaga

source: Conflicts
pl: Konflikty

source: Obsoletes
pl: Zbędne

source: Distribution
pl: Dystrybucja

source: BuildRequires
pl: ZbudowanieWymaga

source: Icon
pl: Obrazek

source: Obviously, supplying even a few of these options on the command-line would be tedious and error-prone, so it's usually best to put them in the setup configuration file, :file:`setup.cfg`\ ---see section :ref:`setup-config`. If you distribute or package many Python module distributions, you might want to put options that apply to all of them in your personal Distutils configuration file (:file:`~/.pydistutils.cfg`). If you want to temporarily disable this file, you can pass the --no-user-cfg option to setup.py.
pl: Oczywiście, dostarczenie nawet kilku z tych opcji w wierszu poleceń byłoby nużące i podatne na błędy, więc zazwyczaj najlepiej jest umieścić je w pliku konfiguracji instalacji, :file:`setup.cfg`\ ---zobacz rozdział :ref:`setup-config`. Jeśli rozprowadzasz lub pakujesz wiele dystrybucji modułów języka pytonowskiego, może się zdarzyć, że będziesz wolał umieścić opcje które odnoszą się do nich wszystkich w twoim osobistym pliku konfiguracji Distutils (:file:`~/.pydistutils.cfg`). Jeśli chcesz tymczasowo wyłączyć ten plik możesz przekazać opcję --no-user-cfg do setup.py.

source: There are three steps to building a binary RPM package, all of which are handled automatically by the Distutils:
pl: Istnieją trzy kroki do zbudowania binarnego pakietu RPM, z których wszystkie są obsługiwane automatycznie przez Distutils:

source: create a :file:`.spec` file, which describes the package (analogous to the Distutils setup script; in fact, much of the information in the setup script winds up in the :file:`.spec` file)
pl: utwórz plik :file:`.spec`, który opisuje pakiet (analogiczny do skryptu instalacyjnego Distutils; w rzeczywistości, większość informacji w skrypcie instalacyjnym ląduje do pliku :file:`.spec`)

source: create the source RPM
pl: stwórz źródłowy RPM

source: create the "binary" RPM (which may or may not contain binary code, depending on whether your module distribution contains Python extensions)
pl: stwórz "binarny" pakiet RPM (który może zawierać lub może nie zawierać kodu binarnego, w zależności od tego czy dystrybucja modułu zawiera rozszerzenia języka pytonowskiego)

source: Normally, RPM bundles the last two steps together; when you use the Distutils, all three steps are typically bundled together.
pl: Zwykle, pakiet RPM gromadzi dwa ostatnie kroki razem; gdy używasz Distutils, wszystkie trzy kroki są zwyczajowo zgromadzone razem.

source: If you wish, you can separate these three steps. You can use the :option:`--spec-only` option to make :command:`bdist_rpm` just create the :file:`.spec` file and exit; in this case, the :file:`.spec` file will be written to the "distribution directory"---normally :file:`dist/`, but customizable with the :option:`--dist-dir` option. (Normally, the :file:`.spec` file winds up deep in the "build tree," in a temporary directory created by :command:`bdist_rpm`.)
pl: Jeśli wolisz, możesz rozdzielić te trzy kroki. Możesz użyć opcji :option:`--spec-only` aby polecenie :command:`bdist_rpm` po prostu stworzyło plik :file:`.spec` i zakończyło wykonanie; w tym przypadku plik :file:`.spec` zostanie zapisany do "katalogu dystrybucji" --- zwykle :file:`dist/`, ale z możliwością zmiany za pomocą opcji :option:`--dist-dir`. (Normalnie, plik :file:`.spec` jest umieszczany głęboko zagrzebany w strukturze "katalogów budowania", w katalogu tymczasowym stworzonym przez polecenie :command:`bdist_rpm`.)

source: Creating Windows Installers
pl: Tworzenie Instalatorów Windows

source: Executable installers are the natural format for binary distributions on Windows. They display a nice graphical user interface, display some information about the module distribution to be installed taken from the metadata in the setup script, let the user select a few options, and start or cancel the installation.
pl: Wykonywalne instalatory są zwykłym formatem dla binarnych dystrybucji w Windows. Wyświetlają miły graficzny sprzęg użytkownika, wyświetlają pewne informacje o dystrybucji modułu do zainstalowania wziętej z opisu pakietu ze skryptu instalacyjnego, pozwalają użytkownikowi wybrać kilka opcji, i zacząć lub anulować instalację.

source: Since the metadata is taken from the setup script, creating Windows installers is usually as easy as running::
pl: Ponieważ meta-dane wzięte są ze skryptu instalacyjnego, tworzenie instalatorów Windows jest zwykle tak proste jak uruchomienie::

source: or the :command:`bdist` command with the :option:`--formats` option::
pl: lub polecenia :command:`bdist` z opcją :option:`--format`::

source: If you have a pure module distribution (only containing pure Python modules and packages), the resulting installer will be version independent and have a name like :file:`foo-1.0.win32.exe`. These installers can even be created on Unix platforms or Mac OS X.
pl: Jeśli masz masz czystą dystrybucję z modułami (zawierającą tylko moduły pytonowskie i pakiety), wynikowy instalator będzie niezależny od wersji i będzie miał nazwę jako: :file:`foo-1.0.win32.exe` Takie instalatory mogą nawet być tworzone na maszynie/środowisku Unix-owym lub na Mac OS X.

source: If you have a non-pure distribution, the extensions can only be created on a Windows platform, and will be Python version dependent. The installer filename will reflect this and now has the form :file:`foo-1.0.win32-py2.0.exe`. You have to create a separate installer for every Python version you want to support.
pl: Jeśli masz "nie"czystą dystrybucję, rozszerzenia mogą być tylko tworzone na maszynie/środowisku Windowsowym, i będą zależne od wersji języka pytonowskiego. Nazwa pliku instalatora będzie odzwierciedlać to i będzie miała postać :file:`foo-1.0.win32-py2.0.exe`. Musisz utworzyć oddzielny instalator dla każdej wersji języka pytonowskiego, którą zamierzasz wspierać.

source: The installer will try to compile pure modules into :term:`bytecode` after installation on the target system in normal and optimizing mode. If you don't want this to happen for some reason, you can run the :command:`bdist_wininst` command with the :option:`--no-target-compile` and/or the :option:`--no-target-optimize` option.
pl: Instalator będzie próbował skompilować moduły czystej dystrybucji do postaci kodu kęsowego ( - z ang. - :term:`bytecode`) po instalacji na docelowym systemie w normalnym i zoptymalizowanym trybie. Jeśli nie chcesz aby to nastąpiło z pewnych powodów, możesz uruchomić polecenie :command:`bdist_wininst` z opcją :option:`--no-target-compile` i/lub opcją `--no-target-optimize`

source: By default the installer will display the cool "Python Powered" logo when it is run, but you can also supply your own 152x261 bitmap which must be a Windows :file:`.bmp` file with the :option:`--bitmap` option.
pl: Domyślnie instalator pokazuje bajeranckie logo "Python Powered" w czasie uruchomienia, ale możesz dostarczyć także swoją własną bitmapę o wielkości 152x261 która musi być windowsowskim plikiem bitmapy :file:`.bmp` za pomocą opcji :option:`--bitmap`.

source: The installer will also display a large title on the desktop background window when it is run, which is constructed from the name of your distribution and the version number. This can be changed to another text by using the :option:`--title` option.
pl: Instalator wyświetli także duży tytuł na tle okna pulpitu gdy będzie uruchamiany, który będzie skonstruowany z nazwy dystrybucji i numeru wersji. Można to zmienić na inny tekst przy użyciu opcji :option:`--title`.

source: The installer file will be written to the "distribution directory" --- normally :file:`dist/`, but customizable with the :option:`--dist-dir` option.
pl: Plik instalatora będzie zapisany do "katalogu dystrybucji" --- zwykle :file:`dist/`, ale można to dostosować opcją :option:`--dist-dir`.

source: Cross-compiling on Windows
pl: Krzyżowa-kompilacja w Windows.

source: Starting with Python 2.6, distutils is capable of cross-compiling between Windows platforms. In practice, this means that with the correct tools installed, you can use a 32bit version of Windows to create 64bit extensions and vice-versa.
pl: Poczynając od języka pytonowskiego 2.6, distutils jest w stanie krzyżowo-kompilować pomiędzy maszynami/środowiskami windowsowskimi. W praktyce, to oznacza, że z właściwymi narzędziami zainstalowanymi, możesz użyć 32bitowej wersji Windows aby utworzyć 64bitowe rozszerzenia i odwrotnie (64 bitowego Windowsa aby utworzyć 32 bitowe rozszerzenia).

source: To build for an alternate platform, specify the :option:`--plat-name` option to the build command. Valid values are currently 'win32', 'win-amd64' and 'win-ia64'. For example, on a 32bit version of Windows, you could execute::
pl: Aby zbudować dla odmiennych maszyn/środowisk, użyj opcji :option:`--plat-name` dla polecenia budowania. Właściwe wartości to obecnie 'win32', 'win-amd64' i 'win-ia64'. Na przykład na 32bitowej wersji Windows możesz wykonać::

source: to build a 64bit version of your extension. The Windows Installers also support this option, so the command::
pl: aby zbudować 64bitową wersję rozszerzenia. Instalatory Windows także wspierają tą opcję, więc polecenie::

source: would create a 64bit installation executable on your 32bit version of Windows.
pl: stworzyłoby 64-bitowy plik wykonywalny instalacji na twojej 32-bitowej wersji Windows.

source: To cross-compile, you must download the Python source code and cross-compile Python itself for the platform you are targetting - it is not possible from a binary installtion of Python (as the .lib etc file for other platforms are not included.) In practice, this means the user of a 32 bit operating system will need to use Visual Studio 2008 to open the :file:`PCBuild/PCbuild.sln` solution in the Python source tree and build the "x64" configuration of the 'pythoncore' project before cross-compiling extensions is possible.
pl: Aby krzyżowo kompilować, musisz pobrać kod źródłowy języka pytonowskiego i krzyżowo-kompilować sam język pytonowski dla maszyny/środowiska docelowego - nie jest to możliwe z poziomu binarnej instalacji języka pytonowskiego (jako, że pliki .lib itp. dla innych maszyn/środowisk nie są załączone.) W praktyce, to oznacza że użytkownik 32 bitowego systemu operacyjnego będzie potrzebował użyć Visual Studio 2008 aby otworzyć rozwiązanie :file:`PCBuild/PCbuild.sln` w drzewie źródłowym i zbudować konfigurację "x64" projektu 'pythoncore' przed tym, jak krzyżowa kompilacja rozszerzeń będzie możliwa.

source: Note that by default, Visual Studio 2008 does not install 64bit compilers or tools. You may need to reexecute the Visual Studio setup process and select these tools (using Control Panel->[Add/Remove] Programs is a convenient way to check or modify your existing install.)
pl: Zauważ że domyślnie, Visual Studio 2008 nie instaluje kompilatorów 64-bitowych kompilatorów ani narzędzi. Możesz potrzebować przejść jeszcze raz proces instalacyjny Visual Studio i wybrać te narzędzia (używanie Panelu Sterowania->[Dodaj/Usuń] Programy jest wygodnym sposobem aby sprawdzić lub zmodyfikować istniejącą instalację.)

source: The Postinstallation script
pl: Skrypt poinstalacyjny

source: Starting with Python 2.3, a postinstallation script can be specified with the :option:`--install-script` option. The basename of the script must be specified, and the script filename must also be listed in the scripts argument to the setup function.
pl: Zaczynając od wersji 2.3 języka pytonowskiego, skrypt poinstalacyjny może być specyfikowany z opcją :option:`--install-script`. Nazwa bazowa skryptu musi być określona, i nazwa pliku skryptu musi także być na liście skryptów jako parametr do zadania instalacji.

source: This script will be run at installation time on the target system after all the files have been copied, with ``argv[1]`` set to :option:`-install`, and again at uninstallation time before the files are removed with ``argv[1]`` set to :option:`-remove`.
pl: Ten skrypt będzie uruchamiany w czasie instalacji na docelowej maszynie/środowisku po tym, jak wszystkie pliki zostaną skopiowane, z ``argv[1]`` ustawionym na :option:`-install`, i znów w czasie odinstalowywania przed tym, jak pliki zostaną usunięte z ``argv[1]`` ustawioną na :option:`-remove`.

source: The installation script runs embedded in the windows installer, every output (``sys.stdout``, ``sys.stderr``) is redirected into a buffer and will be displayed in the GUI after the script has finished.
pl: Skrypt instalacyjny uruchamia się załączony w instalatorze windows, każde wyjście (``sys.stdout``, ``sys.stderr``) jest przekierowane do bufora i zostanie wyświetlona w GUI (sprzęgu graficznym użytkownika) po tym jak skrypt się zakończy.

source: Some functions especially useful in this context are available as additional built-in functions in the installation script.
pl: Niektóre zadania szczególnie użyteczne w tym kontekście są dostępne jako dodatkowe wbudowane zadania w skrypcie instalacyjnym.

source: These functions should be called when a directory or file is created by the postinstall script at installation time. It will register *path* with the uninstaller, so that it will be removed when the distribution is uninstalled. To be safe, directories are only removed if they are empty.
pl: Te zadania powinny być uruchamiane gdy katalog lub plik jest tworzony przez skrypt poinstalacyjny w czasie instalacji. Zarejestruje on *ścieżkę* w programie odinstalowującym, tka, aby był usunięty gdy dystrybucja jest odinstalowywana. Dla bezpieczeństwa, katalogi są usuwane tylko, jeśli są puste.

source: This function can be used to retrieve special folder locations on Windows like the Start Menu or the Desktop. It returns the full path to the folder. *csidl_string* must be one of the following strings::
pl: To zadanie może być używane do pobierania szczególnych miejsc w Windows takich jak menu Start lub pulpit. Zwraca pełną ścieżkę dostępu do folderu. *csidl_string* musi być jednym z następujących ciągów znaków::

source: If the folder cannot be retrieved, :exc:`OSError` is raised.
pl: Jeśli folder nie może być pobrany wyjątek :exc:`OSError` jest zgłaszany.

source: Which folders are available depends on the exact Windows version, and probably also the configuration. For details refer to Microsoft's documentation of the :cfunc:`SHGetSpecialFolderPath` function.
pl: To, które katalogi są dostępne zależy od wersji Windows, i prawdopodobnie też od konfiguracji. DLa szczegółów zajrzyj do dokumentacji Microsoftu dotyczącej zadania :cfunc:`SHGetSpecialFolderPath.

source: This function creates a shortcut. *target* is the path to the program to be started by the shortcut. *description* is the description of the shortcut. *filename* is the title of the shortcut that the user will see. *arguments* specifies the command line arguments, if any. *workdir* is the working directory for the program. *iconpath* is the file containing the icon for the shortcut, and *iconindex* is the index of the icon in the file *iconpath*. Again, for details consult the Microsoft documentation for the :class:`IShellLink` interface.
pl: To zadanie tworzy skrót. *cel* ( - z ang. - *target* ) jest ścieżką do programu do uruchomienia przez skrót. *description* jest opisem skrótu. *filename* jest tytułem skrótu który użytkownik zobaczy. *arguments* określa parametry wiersza polecenia, jeśli jakieś mają wystąpić. *workdir* jest katalogiem roboczym dla programu. *iconpath* jest ścieżką dostępu do pliku zawierającego obrazek dla skrótu, zaś *iconindex* jest indeksem obrazka w pliku *iconpath*. Znów po więcej szczegółów zwróć się do dokumentacji Microsoftu pod hasłem sprzęgu :class:`IShellLink`.

source: Vista User Access Control (UAC)
pl: Kontrola Dostępu Użytkowników (UAC) z Visty

source: Starting with Python 2.6, bdist_wininst supports a :option:`--user-access-control` option. The default is 'none' (meaning no UAC handling is done), and other valid values are 'auto' (meaning prompt for UAC elevation if Python was installed for all users) and 'force' (meaning always prompt for elevation).
pl: Zaczynając od wersji 2.6 języka pytonowskiego, bdist_wininst wspiera opcję :option:`--user-access-control`. Domyślna wartość jest 'none' - z ang. - 'żaden' (oznaczająca że żadna kontrola dostępu użytkownika nie jest w użyciu), zaś inne prawidłowe wartości są 'auto' (oznaczające zapytanie dla podniesienia UAC jeśli programy języka pytonowskiego były instalowane dla wszystkich użytkowników) i 'force' - z ang. - 'zmuś' (oznaczająca zawsze zapytania o zezwolenie).

source: Command Reference
pl: Podręcznik poleceń

source: Installing modules: the :command:`install` command family
pl: Instalowanie modułów: rodzina poleceń :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
pl: Polecenie install zapewnia, że polecenia budowy zostały uruchomione a potem uruchamia podrzędne polecenia :command:`install_lib`, :command:`install_data` i :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
pl: To polecenie instaluje wszystkie pliki danych dostarczone do dystrybucji.

source: This command installs all (Python) scripts in the distribution.
pl: To polecenie instaluje wszystkie skrypty języka pytonowskiego w dystrybucji.

source: Writing the Setup Configuration File
pl: Pisanie pliku konfiguracyjnego instalacji

source: Often, it's not possible to write down everything needed to build a distribution *a priori*: you may need to get some information from the user, or from the user's system, in order to proceed. As long as that information is fairly simple---a list of directories to search for C header files or libraries, for example---then providing a configuration file, :file:`setup.cfg`, for users to edit is a cheap and easy way to solicit it. Configuration files also let you provide default values for any command option, which the installer can then override either on the command-line or by editing the config file.
pl: Często nie jest możliwe zapisanie wszystkiego potrzebnego do zbudowania dystrybucji *a priori*: możesz potrzebować zdobyć pewne informacje od użytkownika, lub z systemu użytkownika, w celu przejścia dalej. O ile ta informacje jest raczej prosta---lista katalogów do przeszukania na okoliczność plików nagłówkowych C lub bibliotek, dla przykładu---potem dostarczając plik konfiguracji, :file:`setup.cfg`, dla użytkowników aby poddać go edycji jest tanim i łatwym sposobem aby ją uzyskać. Pliki konfiguracji także pozwalają ci dostarczyć domyślne wartości dla dowolnych opcji polecenia, które instalator może wtedy obejść zarówno w linii poleceń lub przez edycję pliku konfiguracyjnego.

source: The setup configuration file is a useful middle-ground between the setup script ---which, ideally, would be opaque to installers [#]_---and the command-line to the setup script, which is outside of your control and entirely up to the installer. In fact, :file:`setup.cfg` (and any other Distutils configuration files present on the target system) are processed after the contents of the setup script, but before the command-line. This has several useful consequences:
pl: Plik konfiguracji instalacji jest użytecznym złotym-środkiem pomiędzy skryptem instalacyjnym --- który idealnie byłby przezroczysty dla instalatorów [#]_ ---i wierszem-poleceń do skryptu instalacyjnego, który jest poza twoją kontrolą i całkowicie zależnym od instalatora. W rzeczywistości, plik :file:`setup.cfg` (i jakiekolwiek inne pliki konfiguracji Distutils obecne w docelowym systemie) jest przetwarzany po zawartości skryptu instalacyjnego, ale przed linią-poleceń. Ma to kilka użytecznych konsekwencji:

source: installers can override some of what you put in :file:`setup.py` by editing :file:`setup.cfg`
pl: Instalatory mogą obejść część tego co umieścisz w pliku :file:`setup.py` przez edycję :file:`setup.cfg`

source: you can provide non-standard defaults for options that are not easily set in :file:`setup.py`
pl: możesz dostarczyć niestandardowe wartości domyślne dla opcji, które niełatwo się ustawia w pliku :file:`setup.py`

source: installers can override anything in :file:`setup.cfg` using the command-line options to :file:`setup.py`
pl: Instalatory mogą obejść wszystko w pliku :file:`setup.cfg` używając opcji wiersza-poleceń wywołującego skrypt :file:`setup.py`

source: The basic syntax of the configuration file is simple::
pl: Podstawowa składnia pliku konfiguracyjnego jest łatwa::

source: where *command* is one of the Distutils commands (e.g. :command:`build_py`, :command:`install`), and *option* is one of the options that command supports. Any number of options can be supplied for each command, and any number of command sections can be included in the file. Blank lines are ignored, as are comments, which run from a ``'#'`` character until the end of the line. Long option values can be split across multiple lines simply by indenting the continuation lines.
pl: gdzie *command* jest jedną z komend Distutils (np. :command:`build_py`, :command:`install`) i *option* jest jedną z opcji, którą komenda wspiera. Dowolna liczba opci może być dostarczona do każdej komendy, i dowolna liczba sekcji komend może być wewnątrz pliku. Puste linie są ignorowane, tak jak komentarze, które zaczynają się od znaku ``'#'`` i ciągną aż do końca linii. Długie wartości opcji mogą być dzielone pomiędzy kilka linii prosto przez wcięcie linii kontynuacji.

source: You can find out the list of options supported by a particular command with the universal :option:`--help` option, e.g. ::
pl: Możesz poznać listę opcji wspieraną przez konkretną komendę za pomocą uniwersalnej opcji :option:`--help` np. ::
